"""
Задание 1.
Каждое из слов «разработка», «сокет», «декоратор» представить в строковом формате
и проверить тип и содержание соответствующих переменных.
Затем с помощью онлайн-конвертера преобразовать строковые представление в формат Unicode
и также проверить тип и содержимое переменных.
"""

WORD_1 = 'разработка'
print(WORD_1)
print(type(WORD_1))

WORD_2 = 'сокет'
print(WORD_2)
print(type(WORD_2))

WORD_3 = 'декоратор'
print(WORD_2)
print(type(WORD_2))

WORD_UNIC_1 = '\u0440\u0430\u0437\u0440\u0430\u0431\u043e\u0442\u043a\u0430'
print(WORD_UNIC_1)
print(type(WORD_UNIC_1))

WORD_UNIC_2 = '\u0441\u043e\u043a\u0435\u0442'
print(WORD_UNIC_2)
print(type(WORD_UNIC_2))

WORD_UNIC_3 = '\u0434\u0435\u043a\u043e\u0440\u0430\u0442\u043e\u0440'
print(WORD_UNIC_3)
print(type(WORD_UNIC_3))


